In [2]:
import pandas as pd 
india_weather=pd.DataFrame({
    "city":['mumbai','dehli','banglore'],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     dehli           45        60
2  banglore           30        78

In [3]:
us_weather=pd.DataFrame({
    "city":['newyork','chicago','orlando'],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
})
us_weather

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

In [4]:
df=pd.concat([india_weather,us_weather])     #concat function merge two tables and make single table 
df                                           #we can merge more than two tables in single table

       city  temperature  humidity
0    mumbai           32        80
1     dehli           45        60
2  banglore           30        78
0   newyork           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
df=pd.concat([india_weather, us_weather], ignore_index=True)    # it will ignore indexes 
df

       city  temperature  humidity
0    mumbai           32        80
1     dehli           45        60
2  banglore           30        78
3   newyork           21        68
4   chicago           14        65
5   orlando           35        75

In [9]:
df=pd.concat([india_weather, us_weather], keys=["India","US"])
df

             city  temperature  humidity
India 0    mumbai           32        80
      1     dehli           45        60
      2  banglore           30        78
US    0   newyork           21        68
      1   chicago           14        65
      2   orlando           35        75

In [11]:
df.loc["US"]

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

In [25]:
temperature_df=pd.DataFrame({
    "city":['mumbai','dehli','banglore'],
    "temperature":[32,45,30],
},index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     dehli           45
2  banglore           30

In [26]:
windspeed_df=pd.DataFrame({
    "city":['dehli','mumbai'],   # here we deleted the data of banglore
    "windspeed":[7,12],
},index=[1,0])                   #index method is use to change the index of values
windspeed_df                     #index methhod use to align the rows while using concat operation

     city  windspeed
1   dehli          7
0  mumbai         12

In [18]:
df=pd.concat([temperature_df,windspeed_df])    #it will give windspeed as a rows but we want it just after the tempersture column
df

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     dehli         45.0        NaN
2  banglore         30.0        NaN
0    mumbai          NaN        7.0
1     dehli          NaN       12.0
2  banglore          NaN        9.0

In [27]:
df=pd.concat([temperature_df,windspeed_df] ,axis=1)    # axis=1 means given data will be add as column 
df                                                     # axis=0 means given data will be add as rows

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     dehli           45   dehli        7.0
2  banglore           30     NaN        NaN

In [28]:
temperature_df

       city  temperature
0    mumbai           32
1     dehli           45
2  banglore           30

In [31]:
s= pd.Series(['Humidty','Dry','Rain'], name="event")
s

0    Humidty
1        Dry
2       Rain
Name: event, dtype: object

In [32]:
df=pd.concat([temperature_df,s],axis=1)   # here we concat event column into temperature dataframe
df

       city  temperature    event
0    mumbai           32  Humidty
1     dehli           45      Dry
2  banglore           30     Rain